qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/AT32F415xx/at32f415xx.h
/******************  Bit definition for I2C_CTRL2 register  ***************/
#define I2C_CTRL2_CLKFREQ                (0xFFU << 0)
#define I2C_CTRL2_ERRIEN                 (0x1U << 8)
#define I2C_CTRL2_EVTIEN                 (0x1U << 9)
#define I2C_CTRL2_DMAEN                  (0x1U << 11)
#define I2C_CTRL2_DMAEND                 (0x1U << 12)

/******************  Bit definition for I2C_STS1 register  ****************/
#define I2C_STS1_STARTF                  (0x1U << 0)
#define I2C_STS1_ADDR7F                  (0x1U << 1)
#define I2C_STS1_TDC                     (0x1U << 2)
#define I2C_STS1_ADDRHF                  (0x1U << 3)
#define I2C_STS1_STOPF                   (0x1U << 4)
#define I2C_STS1_TDBE                    (0x1U << 7)
#define I2C_STS1_BUSERR                  (0x1U << 8)
#define I2C_STS1_ARLOST                  (0x1U << 9)
#define I2C_STS1_ACKFAIL                 (0x1U << 10)
#define I2C_STS1_OUF                     (0x1U << 11)
#define I2C_STS1_PECERR                  (0x1U << 12)
#define I2C_STS1_TMOUT                   (0x1U << 14)
#define I2C_STS1_ALERTF                  (0x1U << 15)

/******************  Bit definition for I2C_STS2 register  ****************/
#define I2C_STS2_TRMODE                  (0x1U << 0)
#define I2C_STS2_BUSYF                   (0x1U << 1)
#define I2C_STS2_DIRF                    (0x1U << 2)

/******************  Bit definition for I2C_CLKCTRL register  *************/
#define I2C_CLKCTRL_SPEED                (0xFFFU << 0)
#define I2C_CLKCTRL_DUTYMODE             (0x1U << 14)
#define I2C_CLKCTRL_SPEEDMODE            (0x1U << 15)

/*******************  Bit definition for USART_STS register  **************/
#define USART_STS_PERR                   (0x1U << 0)                   
#define USART_STS_FERR                   (0x1U << 1)                   
#define USART_STS_NERR                   (0x1U << 2)                   
#define USART_STS_ROERR                  (0x1U << 3)                   
#define USART_STS_IDLEF                  (0x1U << 4)                  
#define USART_STS_RDBF                   (0x1U << 5)
#define USART_STS_TDC                    (0x1U << 6)
#define USART_STS_TDBE                   (0x1U << 7)
#define USART_STS_BFF                    (0x1U << 8)
#define USART_STS_CTSCF                  (0x1U << 9)

/*******************  Bit definition for USART_DT register  ***************/
#define USART_DT_DT                      (0x1FF << 0)

/******************  Bit definition for USART_CTRL1 register  *************/
#define USART_CTRL1_SBF                  (0x1U << 0)
#define USART_CTRL1_RM                   (0x1U << 1)
#define USART_CTRL1_REN                  (0x1U << 2)
#define USART_CTRL1_TEN                  (0x1U << 3)
#define USART_CTRL1_IDLEIEN              (0x1U << 4)
#define USART_CTRL1_RDBFIEN              (0x1U << 5)
#define USART_CTRL1_TDCIEN               (0x1U << 6)
#define USART_CTRL1_TDBEIEN              (0x1U << 7)
#define USART_CTRL1_PERRIEN              (0x1U << 8)
#define USART_CTRL1_PSEL                 (0x1U << 9)
#define USART_CTRL1_PEN                  (0x1U << 10)
#define USART_CTRL1_WUM                  (0x1U << 11)
#define USART_CTRL1_DBN                  (0x1U << 12)
#define USART_CTRL1_UEN                  (0x1U << 13)

/******************  Bit definition for USART_CTRL2 register  *************/
#define USART_CTRL2_ID                   (0xFU << 0)
#define USART_CTRL2_BFBN                 (0x1U << 5)
#define USART_CTRL2_BFIEN                (0x1U << 6)
#define USART_CTRL2_LBCP                 (0x1U << 8)
#define USART_CTRL2_CLKPHA               (0x1U << 9)
#define USART_CTRL2_CLKPOL               (0x1U << 10)
#define USART_CTRL2_CLKEN                (0x1U << 11)
#define USART_CTRL2_STOPBN               (0x3U << 12)
#define USART_CTRL2_STOP_0               (0x1U << 12)           
#define USART_CTRL2_STOP_1               (0x1U << 13)  
#define USART_CTRL2_STOPBN_1_BITS        (0x0U << 12)
#define USART_CTRL2_STOPBN_0P5_BITS      (0x1U << 12)
#define USART_CTRL2_STOPBN_2_BITS        (0x2U << 12)
#define USART_CTRL2_STOPBN_1P5_BITS      (0x3U << 12)
#define USART_CTRL2_LINEN                (0x1U << 14)

/******************  Bit definition for USART_CTRL3 register  *************/
#define USART_CTRL3_ERRIEN               (0x1U << 0)
#define USART_CTRL3_IRDAEN               (0x1U << 1)
#define USART_CTRL3_IRDALP               (0x1U << 2)
#define USART_CTRL3_SLBEN                (0x1U << 3)
#define USART_CTRL3_SCNACKEN             (0x1U << 4)
#define USART_CTRL3_SCMEN                (0x1U << 5)
#define USART_CTRL3_DMAREN               (0x1U << 6)
#define USART_CTRL3_DMATEN               (0x1U << 7)
#define USART_CTRL3_RTSEN                (0x1U << 8)
#define USART_CTRL3_CTSEN                (0x1U << 9)
#define USART_CTRL3_CTSCFIEN             (0x1U << 10)

/*******************  Bit definition for SPI_CTRL1 register  **************/
#define SPI_CTRL1_CLKPHA                 (0x1U << 0)
#define SPI_CTRL1_CLKPOL                 (0x1U << 1)
#define SPI_CTRL1_MSTEN                  (0x1U << 2)
#define SPI_CTRL1_MDIV                   (0x7U << 3)
#define SPI_CTRL1_MDIV_2                 (0x0U << 3)
#define SPI_CTRL1_MDIV_4                 (0x1U << 3)
#define SPI_CTRL1_MDIV_8                 (0x2U << 3)
#define SPI_CTRL1_MDIV_16                (0x3U << 3)
#define SPI_CTRL1_MDIV_32                (0x4U << 3)
#define SPI_CTRL1_MDIV_64                (0x5U << 3)
#define SPI_CTRL1_MDIV_128               (0x6U << 3)
#define SPI_CTRL1_MDIV_256               (0x7U << 3)
#define SPI_CTRL1_MDIV_512               (0x0U << 3)
#define SPI_CTRL1_MDIV_1024              (0x1U << 3)
#define SPI_CTRL1_SPIEN                  (0x1U << 6)
#define SPI_CTRL1_LTF                    (0x1U << 7)
#define SPI_CTRL1_SWCSIL                 (0x1U << 8)
#define SPI_CTRL1_SWCSEN                 (0x1U << 9)
#define SPI_CTRL1_ORA                    (0x1U << 10)
#define SPI_CTRL1_FBN                    (0x1U << 11)
#define SPI_CTRL1_NTC                    (0x1U << 12)
#define SPI_CTRL1_CCEN                   (0x1U << 13)
#define SPI_CTRL1_SLBTD                  (0x1U << 14)
#define SPI_CTRL1_SLBEN                  (0x1U << 15)

/*******************  Bit definition for SPI_CTRL2 register  **************/
#define SPI_CTRL2_DMAREN                 (0x1U << 0)
#define SPI_CTRL2_DMATEN                 (0x1U << 1)
#define SPI_CTRL2_HWCSOE                 (0x1U << 2)
#define SPI_CTRL2_ERRIE                  (0x1U << 5)
#define SPI_CTRL2_RDBFIE                 (0x1U << 6)
#define SPI_CTRL2_TDBEIE                 (0x1U << 7)
#define SPI_CTRL2_MDIV                   (0x1U << 8)
#define SPI_CTRL2_MDIV_512_1024          (0x1U << 8)

/*******************  Bit definition for SPI_STS register  ********************/
#define SPI_STS_RDBF                     (0x1U << 0)
#define SPI_STS_TDBE                     (0x1U << 1)
#define SPI_STS_ACS                      (0x1U << 2)
#define SPI_STS_TUERR                    (0x1U << 3)
#define SPI_STS_CCERR                    (0x1U << 4)
#define SPI_STS_MMERR                    (0x1U << 5)
#define SPI_STS_ROERR                    (0x1U << 6)
#define SPI_STS_BF                       (0x1U << 7)

/*******************  Bit definition for SPI_I2SCTRL register  *****************/
#define SPI_I2SCTRL_I2SCBN               (0x1U << 0)
#define SPI_I2SCTRL_I2SDBN               (0x3U << 1)
#define SPI_I2SCTRL_I2SDBN_16BITS        (0x0U << 1)
#define SPI_I2SCTRL_I2SDBN_24BITS        (0x1U << 1)
#define SPI_I2SCTRL_I2SDBN_32BITS        (0x2U << 1)
#define SPI_I2SCTRL_I2SDBN_NONE          (0x3U << 1)
#define SPI_I2SCTRL_I2SCLKPOL            (0x1U << 3)
#define SPI_I2SCTRL_STDSEL               (0x3U << 4)
#define SPI_I2SCTRL_STDSEL_PHILIPS       (0x0U << 4)
#define SPI_I2SCTRL_STDSEL_MSB           (0x1U << 4)
#define SPI_I2SCTRL_STDSEL_LSB           (0x2U << 4)
#define SPI_I2SCTRL_STDSEL_PCM           (0x3U << 4)
#define SPI_I2SCTRL_PCMFSSEL             (0x1U << 7)
#define SPI_I2SCTRL_OPERSEL              (0x3U << 8)
#define SPI_I2SCTRL_OPERSEL_ST           (0x0U << 8)
#define SPI_I2SCTRL_OPERSEL_SR           (0x1U << 8)
#define SPI_I2SCTRL_OPERSEL_HT           (0x2U << 8)
#define SPI_I2SCTRL_OPERSEL_HR           (0x3U << 8)
#define SPI_I2SCTRL_I2SEN                (0x1U << 10)
#define SPI_I2SCTRL_I2SMSEL              (0x1U << 11)

/*******************  Bit definition for SPI_I2SCLKP register  ************/
#define SPI_I2SCLKP_I2SDIV_1             (0xFFU << 0)
#define SPI_I2SCLKP_I2SODD               (0x1U << 8)
#define SPI_I2SCLKP_I2SMCLKOE            (0x1U << 9)
#define SPI_I2SCLKP_I2SDIV_2             (0x3U << 10)

/******************  Bit definition for IOMUX_REMAP register  *************/
#define IOMUX_REMAP_SPI1_MUX                ((0x1U << 0) | (0x1U << 31))
#define IOMUX_REMAP_SPI1_MUX_0              (0x1U << 0)   
#define IOMUX_REMAP_SPI1_MUX_1              (0x1U << 31)
#define IOMUX_REMAP_SPI1_MUX_NOREMAP        (0x0U << 0)     /*!< CS/PA4,SCK/PA5,MISO/PA6,MOSI/PA7,MCK/PB0   */
#define IOMUX_REMAP_SPI1_MUX_FULLREMAP      (0x1U << 0)     /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB6  */
#define IOMUX_REMAP_I2C1_MUX                (0x1U << 1)     /*!< SCL/PB8,SDA/PB9 SMBA/PB5                   */
#define IOMUX_REMAP_USART1_MUX              (0x1U << 2)     /*!< TX/PB6,RX/PB7                              */
#define IOMUX_REMAP_USART3_MUX              (0x3U << 4)     
#define IOMUX_REMAP_USART3_MUX_NOREMAP      (0x0U << 4)     /*!< TX/PB10,RX/PB11,CK/PB12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP_USART3_MUX_PARTIALREMAP (0x1U << 4)     /*!< TX/PC10,RX/PC11,CK/PC12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP_USART3_MUX_FULLREMAP    (0x2U << 4)     /*!< TX/PA7,RX/PA6,CK/PA5,CTS/PB1,RTS/PB0       */
#define IOMUX_REMAP_TMR1_MUX                (0x3U << 6)
#define IOMUX_REMAP_TMR1_MUX_NOREMAP        (0x0U << 6)     /*!< EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PB12,CH1C/PB13,CH2C/PB14,CH3C/PB15*/
#define IOMUX_REMAP_TMR1_MUX_FULLREMAP      (0x1U << 6)     /*!< EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PA6,CH1C/PA7,CH2C/PB0,CH3C/PB1*/
#define IOMUX_REMAP_TMR2_MUX                (0x3U << 8)     
#define IOMUX_REMAP_TMR2_MUX_NOREMAP        (0x0U << 8)     /*!< CH1/EXT/PA0,CH2/PA1,CH3/PA2,CH4/PA3 */
#define IOMUX_REMAP_TMR2_MUX_PARTIALREMAP1  (0x1U << 8)     /*!< CH1/EXT/PA15,CH2/PB3,CH3/PA2,CH4/PA3 */
#define IOMUX_REMAP_TMR2_MUX_PARTIALREMAP2  (0x2U << 8)     /*!< CH1/EXT/PA0,CH2/PA1,CH3/PB10,CH4/PB1 */
#define IOMUX_REMAP_TMR2_MUX_FULLREMAP      (0x3U << 8)     /*!< CH1/EXT/PA15,CH2/PB3,CH3/PB10,CH4/PB11 */
#define IOMUX_REMAP_TMR3_MUX                (0x3U << 10)
#define IOMUX_REMAP_TMR3_MUX_NOREMAP        (0x0U << 10)    /*!< CH1/PA6,CH2/PA7,CH3/PB0,CH4/PB1 */
#define IOMUX_REMAP_TMR3_MUX_PARTIALREMAP   (0x2U << 10)    /*!< CH1/PB4,CH2/PB5,CH3/PB0,CH4/PB1 */
#define IOMUX_REMAP_TMR3_MUX_FULLREMAP      (0x3U << 10)    /*!< CH1/PC6,CH2/PC7,CH3/PC8,CH4/PC9 */
#define IOMUX_REMAP_CAN_MUX                 (0x3U << 13)    
#define IOMUX_REMAP_CAN_MUX_NOREMAP         (0x0U << 13)    /*!< RX/PA11,TX/PA12 */
#define IOMUX_REMAP_CAN_MUX_FULLREMAP       (0x2U << 13)    /*!< RX/PB8,TX/PB9 */
#define IOMUX_REMAP_PD01_MUX                (0x1U << 15)    /*!< Port D0/Port D1 mapping on HEXT_IN/HEXT_OUT */
#define IOMUX_REMAP_TMR5CH4_MUX             (0x1U << 16)    /*!< TIM5 Channel4 Internal Remap */
#define IOMUX_REMAP_ADC1_ETP_MUX            (0x1U << 17)    /*!< ADC 1 External Trigger Injected Conversion remapping */
#define IOMUX_REMAP_ADC1_ETO_MUX            (0x1U << 18)    /*!< ADC 1 External Trigger Regular Conversion remapping */
#define IOMUX_REMAP_SWJTAG_MUX              (0x7U << 24)  
#define IOMUX_REMAP_SWJTAG_MUX_RESET        (0x0U << 24)    /*!< Full SWJ (JTAG-DP + SW-DP) : Reset State */
#define IOMUX_REMAP_SWJTAG_MUX_NOJNTRST     (0x1U << 24)    /*!< Full SWJ (JTAG-DP + SW-DP) but without JNTRST */
#define IOMUX_REMAP_SWJTAG_MUX_JTAGDISABLE  (0x2U << 24)    /*!< JTAG-DP Disabled and SW-DP Enabled */
#define IOMUX_REMAP_SWJTAG_MUX_DISABLE      (0x4U << 24)    /*!< JTAG-DP Disabled and SW-DP Disabled */

/******************  Bit definition for IOMUX_REMAP2 register  ************/
#define IOMUX_REMAP2_CMP_MUX                (0x3U << 26)
#define IOMUX_REMAP2_CMP_MUX_NOREMAP        (0x0U << 26)    /*!< CMP1_OUT/PA0,CMP2_OUT/PA2 */
#define IOMUX_REMAP2_CMP_MUX_PARTIALREMAP2  (0x1U << 26)    /*!< CMP1_OUT/PA6,CMP2_OUT/PA7 */
#define IOMUX_REMAP2_CMP_MUX_FULLREMAP      (0x2U << 26)    /*!< CMP1_OUT/PA11,CMP2_OUT/PA12 */

