qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/AT32F415xx/at32f415xx.h
/******************  Bit definition for IOMUX_REMAP3 register  ************/
#define IOMUX_REMAP3_TMR9_GMUX              (0xFU << 0)
#define IOMUX_REMAP3_TMR9_GMUX_NOREMAP      (0x0U << 0)     /*!< TMR9 CH1/PA2 CH2/PA3 */
#define IOMUX_REMAP3_TMR9_GMUX_FULLREMAP    (0x2U << 0)     /*!< TMR9 CH1/PB14 CH2/PB15 */
#define IOMUX_REMAP3_TMR10_GMUX             (0xFU << 4)
#define IOMUX_REMAP3_TMR10_GMUX_NOREMAP     (0x0U << 4)     /*!< TMR10 CH1/PB8 */
#define IOMUX_REMAP3_TMR10_GMUX_FULLREMAP   (0x2U << 4)     /*!< TMR10 CH1/PA6 */
#define IOMUX_REMAP3_TMR11_GMUX             (0xFU << 8)
#define IOMUX_REMAP3_TMR11_GMUX_NOREMAP     (0x0U << 8)     /*!< TMR11 CH1/PB9 */
#define IOMUX_REMAP3_TMR11_GMUX_FULLREMAP   (0x2U << 8)     /*!< TMR11 CH1/PA7 */

/******************  Bit definition for IOMUX_REMAP4 register  ************/
#define IOMUX_REMAP4_TMR1_GMUX               (0xFU << 0)
#define IOMUX_REMAP4_TMR1_GMUX_NOREMAP       (0x0U << 0)    /*!< TMR1 EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PB12,CH1C/PB13,CH2C/PB14,CH3C/PB15 */
#define IOMUX_REMAP4_TMR1_GMUX_PARTIALREMAP1 (0x1U << 0)    /*!< TMR1 EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PA6,CH1C/PA7,CH2C/PB0,CH3C/PB1 */
#define IOMUX_REMAP4_TMR1_GMUX_FULLREMAP     (0x2U << 0)    /*!< TMR1 EXT/PA0,CH1/PC6,CH2/PC7,CH3/PC8,CH4/PC9,BRK/PA6,CH1C/PA7,CH2C/PB0,CH3C/PB1 */
#define IOMUX_REMAP4_TMR2_GMUX               (0x7U << 4)
#define IOMUX_REMAP4_TMR2_GMUX_NOREMAP       (0x0U << 4)    /*!< TMR2 CH1_EXT/PA0 CH2/PA1 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_PARTIALREMAP1 (0x1U << 4)    /*!< TMR2 CH1_EXT/PA15 CH2/PB3 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_PARTIALREMAP2 (0x2U << 4)    /*!< TMR2 CH1_EXT/PA0 CH2/PA1 CH3/PB10 CH4/PB11 */
#define IOMUX_REMAP4_TMR2_GMUX_FULLREMAP     (0x3U << 4)    /*!< TMR2 CH1_EXT/PA15 CH2/PB3 CH3/PB10 CH4/PB11 */
#define IOMUX_REMAP4_TMR3_GMUX               (0xFU << 8)
#define IOMUX_REMAP4_TMR3_GMUX_NOREMAP       (0x0U << 8)    /*!< TMR3 CH1/PA6 CH2/PA7 CH3/PB0 CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_PARTIALREMAP  (0x2U << 8)    /*!< TMR3 CH1/PB4 CH2/PB5 CH3/PB0 CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_FULLREMAP     (0x3U << 8)    /*!< TMR3 CH1/PC6 CH2/PC7 CH3/PC8 CH4/PC9 */
#define IOMUX_REMAP4_TMR5_GMUX               (0x7U << 16)
#define IOMUX_REMAP4_TMR5_GMUX_NOREMAP       (0x0U << 16)   /*!< TMR5 CH1/PA0 CH2/PA1 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR5_GMUX_FULLREMAP     (0x1U << 16)   /*!< TMR5 CH1/PF4 CH2/PF5 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR5CH4_GMUX            (0x1U << 19)
#define IOMUX_REMAP4_TMR5CH4_GMUX_NOREMAP    (0x0U << 19)   /*!< TMR5 CH4/PA3 */
#define IOMUX_REMAP4_TMR5CH4_GMUX_FULLREMAP  (0x1U << 19)   /*!< TMR5 CH4/LICK */

/******************  Bit definition for IOMUX_REMAP5 register  ************/
#define IOMUX_REMAP5_I2C1_GMUX               (0xFU << 4)
#define IOMUX_REMAP5_I2C1_GMUX_NOREMAP       (0x0U << 4)    /*!< SCL/PB6,SDA/PB7 SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_PARTIALREMAP  (0x1U << 4)    /*!< SCL/PB8,SDA/PB9 SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_FULLREMAP     (0x2U << 4)    /*!< SCL/PF6,SDA/PF7 SMBA/PB5 */
#define IOMUX_REMAP5_I2C2_GMUX               (0xFU << 8)
#define IOMUX_REMAP5_I2C2_GMUX_NOREMAP       (0x0U << 8)    /*!< SCL/PB10,SDA/PB11 SMBA/PB12 */
#define IOMUX_REMAP5_I2C2_GMUX_PARTIALREMAP1 (0x1U << 8)    /*!< SCL/PA8,SDA/PC9 SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_PARTIALREMAP2 (0x2U << 8)    /*!< SCL/PA8,SDA/PB4 SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_FULLREMAP     (0x3U << 8)    /*!< SCL/PF6,SDA/PF7 SMBA/PA9 */
#define IOMUX_REMAP5_SPI1_GMUX               (0xFU << 16)
#define IOMUX_REMAP5_SPI1_GMUX_NOREMAP       (0x0U << 16)   /*!< CS/PA4,SCK/PA5,MISO/PA6,MOSI/PA7,MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_FULLREMAP     (0x1U << 16)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB6 */
#define IOMUX_REMAP5_SPI2_GMUX               (0xFU << 20)
#define IOMUX_REMAP5_SPI2_GMUX_NOREMAP       (0x0U << 20)   /*!< CS/PB12,SCK/PB13,MISO/PB14,MOSI/PB15,MCK/PB0 */
#define IOMUX_REMAP5_SPI2_GMUX_FULLREMAP     (0x1U << 20)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PC7 */

/******************  Bit definition for IOMUX_REMAP6 register  ************/
#define IOMUX_REMAP6_CAN1_GMUX                (0xFU << 0)
#define IOMUX_REMAP6_CAN1_GMUX_NOREMAP        (0x0U << 0)    /*!< RX/PA11,TX/PA12 */
#define IOMUX_REMAP6_CAN1_GMUX_FULLREMAP      (0x2U << 0)    /*!< RX/PB8,TX/PB9   */
#define IOMUX_REMAP6_SDIO1_GMUX               (0xFU << 8)
#define IOMUX_REMAP6_SDIO1_GMUX_NOREMAP       (0x0U << 8)    /*!< D0/PC8 D1/PC9 D2/PC10 D3/PC11 D4/PB8 D5/PB9 D6/PC6 D7/PC7 CK/PC12 CMD/PD2 */
#define IOMUX_REMAP6_SDIO1_GMUX_PARTIALREMAP1 (0x4U << 8)    /*!< D0/PC0 D1/PC1 D2/PC2 D3/PC3 D4/PA4 D5/PA5 D6/PA6 D7/PA7 CK/PC4 CMD/PC5 */
#define IOMUX_REMAP6_SDIO1_GMUX_PARTIALREMAP2 (0x5U << 8)    /*!< D0/PA4 D1/PA5 D2/PA6 D3/PA7 CK/PC4 CMD/PC5 */
#define IOMUX_REMAP6_SDIO1_GMUX_PARTIALREMAP3 (0x6U << 8)    /*!< D0/PC0 D1/PC1 D2/PC2 D3/PC3 D4/PA4 D5/PA5 D6/PA6 D7/PA7 CK/PA2 CMD/PA3 */
#define IOMUX_REMAP6_SDIO1_GMUX_FULLREMAP     (0x7U << 8)    /*!< D0/PA4 D1/PA5 D2/PA6 D3/PA7 CK/PA2 CMD/PA3 */
#define IOMUX_REMAP6_USART1_GMUX              (0xFU << 16)
#define IOMUX_REMAP6_USART1_GMUX_NOREMAP      (0x0U << 16)   /*!< TX/PA9 RX/PA10  */
#define IOMUX_REMAP6_USART1_GMUX_FULLREMAP    (0x1U << 16)   /*!< TX/PB6 RX/PB7   */
#define IOMUX_REMAP6_USART3_GMUX              (0xFU << 24)
#define IOMUX_REMAP6_USART3_GMUX_NOREMAP      (0x0U << 24)   /*!< TX/PB10,RX/PB11,CK/PB12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP6_USART3_GMUX_PARTIALREMAP (0x1U << 24)   /*!< TX/PC10,RX/PC11,CK/PC12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP6_USART3_GMUX_FULLREMAP    (0x2U << 24)   /*!< TX/PA7,RX/PA6,CK/PA5,CTS/PB1,RTS/PB0  */
#define IOMUX_REMAP6_UART4_GMUX               (0xFU << 28)
#define IOMUX_REMAP6_UART4_GMUX_NOREMAP       (0x0U << 28)   /*!< TX/PC10 RX/PC11  */
#define IOMUX_REMAP6_UART4_GMUX_FULLREMAP     (0x2U << 28)   /*!< TX/PF4 RX/PF5    */

/******************  Bit definition for IOMUX_REMAP7 register  ************/
#define IOMUX_REMAP7_ADC1_ETP_GMUX            (0x1U << 4)
#define IOMUX_REMAP7_ADC1_ETP_GMUX_NOREMAP    (0x0U << 4)    
#define IOMUX_REMAP7_ADC1_ETP_GMUX_FULLREMAP  (0x1U << 4)    /*!< ADC1 抢占转换外部触发连接到 TMR1 通道 4 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX            (0x1U << 5)
#define IOMUX_REMAP7_ADC1_ETO_GMUX_NOREMAP    (0x0U << 5)    /*!< ADC1 普通转换外部触发连接到 EXINT11 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_FULLREMAP  (0x1U << 5)    /*!< ADC1 普通转换外部触发连接到 TMR1_TRGO */
#define IOMUX_REMAP7_SWJTAG_GMUX              (0x7U << 16)  
#define IOMUX_REMAP7_SWJTAG_GMUX_RESET        (0x0U << 16)   /*!< Full SWJ (JTAG-DP + SW-DP) : Reset State */
#define IOMUX_REMAP7_SWJTAG_GMUX_NOJNTRST     (0x1U << 16)   /*!< Full SWJ (JTAG-DP + SW-DP) but without JNTRST */
#define IOMUX_REMAP7_SWJTAG_GMUX_JTAGDISABLE  (0x2U << 16)   /*!< JTAG-DP Disabled and SW-DP Enabled */
#define IOMUX_REMAP7_SWJTAG_GMUX_DISABLE      (0x4U << 16)   /*!< JTAG-DP Disabled and SW-DP Disabled */
#define IOMUX_REMAP7_PD01_GMUX                (0x1U << 20)   /*!< Port D0/Port D1 mapping on HEXT_IN/HEXT_OUT */
#define IOMUX_REMAP7_PD01_GMUX_NOREMAP        (0x0U << 20)   /*!< NO REMAP */
#define IOMUX_REMAP7_PD01_GMUX_FULLREMAP      (0x1U << 20)   /*!< Port D0/Port D1 mapping on HEXT_IN/HEXT_OUT */

/******************  Bit definition for DEBUG_CTRL register  **************/
#define DEBUG_CTRL_SLEEP                 (0x1U << 0)
#define DEBUG_CTRL_DEEPSLEEP             (0x1U << 1)
#define DEBUG_CTRL_STANDBY               (0x1U << 2)
#define DEBUG_CTRL_WDT_PAUSE             (0x1U << 8)
#define DEBUG_CTRL_WWDT_PAUSE            (0x1U << 9)
#define DEBUG_CTRL_TMR1_PAUSE            (0x1U << 10)
#define DEBUG_CTRL_TMR2_PAUSE            (0x1U << 11)
#define DEBUG_CTRL_TMR3_PAUSE            (0x1U << 12)
#define DEBUG_CTRL_TMR4_PAUSE            (0x1U << 13)
#define DEBUG_CTRL_CAN1_PAUSE            (0x1U << 14)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT    (0x1U << 15)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT    (0x1U << 16)
#define DEBUG_CTRL_TMR5_PAUSE            (0x1U << 18)
#define DEBUG_CTRL_TMR9_PAUSE            (0x1U << 28)
#define DEBUG_CTRL_TMR10_PAUSE           (0x1U << 29)
#define DEBUG_CTRL_TMR11_PAUSE           (0x1U << 30)

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE                       ((uint32_t)0x08000000)
#define SPIM_FLASH_BASE                  ((uint32_t)0x08400000)
#define USD_BASE                         ((uint32_t)0x1FFFF800)
#define SRAM_BASE                        ((uint32_t)0x20000000)
#define PERIPH_BASE                      ((uint32_t)0x40000000)
#define DEBUG_BASE                       ((uint32_t)0xE0042000)

#define APB1PERIPH_BASE                  (PERIPH_BASE + 0x00000)
#define APB2PERIPH_BASE                  (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                   (PERIPH_BASE + 0x20000)

/* apb1 bus base address */
#define TMR2_BASE                        (APB1PERIPH_BASE + 0x0000)
#define TMR3_BASE                        (APB1PERIPH_BASE + 0x0400)
#define TMR4_BASE                        (APB1PERIPH_BASE + 0x0800)
#define TMR5_BASE                        (APB1PERIPH_BASE + 0x0C00)
#define CMP_BASE                         (APB1PERIPH_BASE + 0x2400)
#define ERTC_BASE                        (APB1PERIPH_BASE + 0x2800)
#define WWDT_BASE                        (APB1PERIPH_BASE + 0x2C00)
#define WDT_BASE                         (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                        (APB1PERIPH_BASE + 0x3800)
#define USART2_BASE                      (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                      (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE                       (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE                       (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE                        (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                        (APB1PERIPH_BASE + 0x5800)
#define CAN1_BASE                        (APB1PERIPH_BASE + 0x6400)
#define PWC_BASE                         (APB1PERIPH_BASE + 0x7000)
/* apb2 bus base address */
#define IOMUX_BASE                       (APB2PERIPH_BASE + 0x0000)
#define EXINT_BASE                       (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                       (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                       (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                       (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                       (APB2PERIPH_BASE + 0x1400)
#define GPIOF_BASE                       (APB2PERIPH_BASE + 0x1C00)
#define ADC1_BASE                        (APB2PERIPH_BASE + 0x2400)
#define TMR1_BASE                        (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                        (APB2PERIPH_BASE + 0x3000)
#define USART1_BASE                      (APB2PERIPH_BASE + 0x3800)
#define TMR9_BASE                        (APB2PERIPH_BASE + 0x4C00)
#define TMR10_BASE                       (APB2PERIPH_BASE + 0x5000)
#define TMR11_BASE                       (APB2PERIPH_BASE + 0x5400)
#define SDIO1_BASE                       (APB2PERIPH_BASE + 0x8000)
/* ahb bus base address */
#define DMA1_BASE                        (AHBPERIPH_BASE + 0x0000)
#define DMA1_CHANNEL1_BASE               (AHBPERIPH_BASE + 0x0008)
#define DMA1_CHANNEL2_BASE               (AHBPERIPH_BASE + 0x001C)
#define DMA1_CHANNEL3_BASE               (AHBPERIPH_BASE + 0x0030)
#define DMA1_CHANNEL4_BASE               (AHBPERIPH_BASE + 0x0044)
#define DMA1_CHANNEL5_BASE               (AHBPERIPH_BASE + 0x0058)
#define DMA1_CHANNEL6_BASE               (AHBPERIPH_BASE + 0x006C)
#define DMA1_CHANNEL7_BASE               (AHBPERIPH_BASE + 0x0080)
#define DMA2_BASE                        (AHBPERIPH_BASE + 0x0400)
#define DMA2_CHANNEL1_BASE               (AHBPERIPH_BASE + 0x0408)
#define DMA2_CHANNEL2_BASE               (AHBPERIPH_BASE + 0x041C)
#define DMA2_CHANNEL3_BASE               (AHBPERIPH_BASE + 0x0430)
#define DMA2_CHANNEL4_BASE               (AHBPERIPH_BASE + 0x0444)
#define DMA2_CHANNEL5_BASE               (AHBPERIPH_BASE + 0x0458)
#define DMA2_CHANNEL6_BASE               (AHBPERIPH_BASE + 0x046C)
#define DMA2_CHANNEL7_BASE               (AHBPERIPH_BASE + 0x0480)
#define CRM_BASE                         (AHBPERIPH_BASE + 0x1000)
#define FLASH_REG_BASE                   (AHBPERIPH_BASE + 0x2000)
#define CRC_BASE                         (AHBPERIPH_BASE + 0x3000)
#define OTGFS1_BASE                      (PERIPH_BASE + 0x10000000)

#define FLASHSIZE_BASE                   ((uint32_t)0x1FFFF7E0U)    /*!< FLASH Size register base address */
#define UID_BASE                         ((uint32_t)0x1FFFF7E8U)    /*!< Unique device ID register base address */

/**
  * @}
  */
/**
  * @brief type define exint register all
  */
typedef struct
{

  /**
    * @brief exint inten register, offset:0x00
    */
  __IO uint32_t INTEN;

  /**
    * @brief exint evten register, offset:0x04
    */
  __IO uint32_t EVTEN;

  /**
    * @brief exint polcfg1 register, offset:0x08
    */
  __IO uint32_t POLCFG1;

  /**
    * @brief exint polcfg2 register, offset:0x0C
    */
  __IO uint32_t POLCFG2;

  /**
    * @brief exint swtrg register, offset:0x10
    */
  __IO uint32_t SWTRG;

  /**
    * @brief exint intsts register, offset:0x14
    */
  __IO uint32_t INTSTS;

} EXINT_TypeDef;

/**
  * @brief type define crm register all
  */
typedef struct
{
  /**
    * @brief crm ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief crm cfg register, offset:0x04
    */
  __IO uint32_t CFG;

  /**
    * @brief crm clkint register, offset:0x08
    */
  __IO uint32_t CLKINT;

  /**
    * @brief crm apb2rst register, offset:0x0C
    */
  __IO uint32_t APB2RST;
  
  /**
    * @brief crm apb1rst register, offset:0x10
    */
  __IO uint32_t APB1RST;
    
  /**
    * @brief crm ahben register, offset:0x14
    */
  __IO uint32_t AHBEN;

  /**
    * @brief crm apb2en register, offset:0x18
    */
  __IO uint32_t APB2EN;

  /**
    * @brief crm apb1en register, offset:0x1C
    */
  __IO uint32_t APB1EN;
  
  /**
    * @brief crm bpdc register, offset:0x20
    */
  __IO uint32_t BPDC;
  
  /**
    * @brief crm ctrlsts register, offset:0x24
    */
  __IO uint32_t CTRLSTS;

  /**
    * @brief crm ahbrst register, offset:0x28
    */
  __IO uint32_t AHBRST;

  /**
    * @brief crm pll register, offset:0x2C
    */
  __IO uint32_t PLL;

  /**
    * @brief crm misc1 register, offset:0x30
    */
  __IO uint32_t MISC1;

  /**
    * @brief crm reserved2 register, offset:0x40~0x34
    */
  __IO uint32_t RESERVED2[4];

  /**
    * @brief crm otg_extctrl register, offset:0x44
    */
  __IO uint32_t OTG_EXTCTRL;

  /**
    * @brief crm reserved3 register, offset:0x50~0x48
    */
  __IO uint32_t RESERVED3[3];

  /**
    * @brief crm misc2 register, offset:0x54
    */
  __IO uint32_t MISC2;

} CRM_TypeDef;

/**
  * @brief type define pwc register all
  */
typedef struct
{
  /**
    * @brief pwc ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief pwc ctrlsts register, offset:0x04
    */
  __IO uint32_t CTRLSTS;

} PWC_TypeDef;

/**
  * @brief type define flash register all
  */
typedef struct
{
  /**
    * @brief flash psr register, offset:0x00
    */
  __IO uint32_t PSR;

  /**
    * @brief flash unlock register, offset:0x04
    */
  __IO uint32_t UNLOCK;

  /**
    * @brief flash usd unlock register, offset:0x08
    */
  __IO uint32_t USD_UNLOCK;

  /**
    * @brief flash sts register, offset:0x0C
    */
  __IO uint32_t STS;

  /**
    * @brief flash ctrl register, offset:0x10
    */
  __IO uint32_t CTRL;

  /**
    * @brief flash addr register, offset:0x14
    */
  __IO uint32_t ADDR;

  /**
    * @brief flash reserved1 register, offset:0x18
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief flash usd register, offset:0x1C
    */
  __IO uint32_t USD;

  /**
    * @brief flash epps register, offset:0x20
    */
  __IO uint32_t EPPS;

  /**
    * @brief flash reserved2 register, offset:0x70~0x24
    */
  __IO uint32_t RESERVED2[20];

  /**
    * @brief flash slib_sts0 register, offset:0x74
    */
  __IO uint32_t SLIB_STS0;

  /**
    * @brief flash slib_sts1 register, offset:0x78
    */
  __IO uint32_t SLIB_STS1;

  /**
    * @brief flash slib_pwd_clr register, offset:0x7C
    */
  __IO uint32_t SLIB_PWD_CLR;

  /**
    * @brief flash slib_misc_sts register, offset:0x80
    */
  __IO uint32_t SLIB_MISC_STS;

  /**
    * @brief flash crc_addr register, offset:0x84
    */
  __IO uint32_t CRC_ADDR;

  /**
    * @brief flash crc_ctrl register, offset:0x88
    */
  __IO uint32_t CRC_CTRL;

  /**
    * @brief flash crc_chkr register, offset:0x8C
    */
  __IO uint32_t CRC_CHKR;

  /**
    * @brief flash reserved3 register, offset:0x15C~0x90
    */
  __IO uint32_t RESERVED3[52];

  /**
    * @brief flash slib_set_pwd register, offset:0x160
    */
  __IO uint32_t SLIB_SET_PWD;

  /**
    * @brief flash slib_set_range register, offset:0x164
    */
  __IO uint32_t SLIB_GET_RANGE;

  /**
    * @brief flash em_slib_set register, offset:0x168
    */
  __IO uint32_t EM_SLIB_SET;

  /**
    * @brief flash btm_mode_set register, offset:0x16C
    */
  __IO uint32_t BTM_MODE_SET;

  /**
    * @brief flash slib_unlock register, offset:0x170
    */
  __IO uint32_t SLIB_UNLOCK;

} FLASH_TypeDef;

/**
  * @brief type define gpio register all
  */
typedef struct
{
  /**
    * @brief gpio cfglr register, offset:0x00
    */
  __IO uint32_t CFGLR;

  /**
    * @brief gpio cfghr register, offset:0x04
    */
  __IO uint32_t CFGHR;

  /**
    * @brief gpio idt register, offset:0x08
    */
  __IO uint32_t IDT;

  /**
    * @brief gpio odt register, offset:0x0C
    */
  __IO uint32_t ODT;

  /**
    * @brief gpio scr register, offset:0x10
    */
  __IO uint32_t SCR;

  /**
    * @brief gpio clr register, offset:0x14
    */
  __IO uint32_t CLR;
  /**
    * @brief gpio wpr register, offset:0x18
    */
  __IO uint32_t WPR;

