qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/AT32F415xx/at32f415xx.h
} GPIO_TypeDef;

/**
  * @brief type define iomux register all
  */
typedef struct
{
  /**
    * @brief mux event control register, offset:0x00
    */
  __IO uint32_t EVTOUT;

  /**
    * @brief iomux remap register, offset:0x04
    */
  __IO uint32_t REMAP;

  /**
    * @brief mux external interrupt configuration register 1-3, offset:0x08
    */
  __IO uint32_t EXINTC[4];

  /**
    * @brief iomux reserved1 register, offset:0x18
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief iomux remap register 2, offset:0x1C
    */
  __IO uint32_t REMAP2;

  /**
    * @brief iomux remap register 3, offset:0x20
    */
  __IO uint32_t REMAP3;

  /**
    * @brief iomux remap register 4, offset:0x24
    */
  __IO uint32_t REMAP4;

  /**
    * @brief iomux remap register 5, offset:0x28
    */
  __IO uint32_t REMAP5;

  /**
    * @brief iomux remap register 6, offset:0x2C
    */
  __IO uint32_t REMAP6;

  /**
    * @brief iomux remap register 7, offset:0x30
    */
  __IO uint32_t REMAP7;

  /**
    * @brief iomux remap register 8, offset:0x34
    */
  __IO uint32_t REMAP8;
} IOMUX_TypeDef;

/**
  * @brief type define tmr register all
  */
typedef struct
{
  /**
    * @brief tmr ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief tmr ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief tmr smc register, offset:0x08
    */
  __IO uint32_t STCTRL;

  /**
    * @brief tmr die register, offset:0x0C
    */
  __IO uint32_t IDEN;

  /**
    * @brief tmr ists register, offset:0x10
    */
  __IO uint32_t ISTS;

  /**
    * @brief tmr eveg register, offset:0x14
    */
  __IO uint32_t SWEVT;

  /**
    * @brief tmr ccm1 register, offset:0x18
    */
  __IO uint32_t CM1;

  /**
    * @brief tmr ccm2 register, offset:0x1C
    */
  __IO uint32_t CM2;

  /**
    * @brief tmr cce register, offset:0x20
    */
  __IO  uint32_t CCTRL;

  /**
    * @brief tmr cnt register, offset:0x24
    */
  __IO uint32_t CVAL;

  /**
    * @brief tmr div, offset:0x28
    */
  __IO uint32_t DIV;

  /**
    * @brief tmr pr register, offset:0x2C
    */
  __IO  uint32_t PR;

  /**
    * @brief tmr rpr register, offset:0x30
    */
  __IO uint32_t RPR;

  /**
    * @brief tmr c1dt register, offset:0x34
    */
  __IO uint32_t C1DT;


  /**
    * @brief tmr c2dt register, offset:0x38
    */
  __IO uint32_t C2DT;

  /**
    * @brief tmr c3dt register, offset:0x3C
    */
  __IO uint32_t C3DT;

  /**
    * @brief tmr c4dt register, offset:0x40
    */
  __IO uint32_t C4DT;

  /**
    * @brief tmr brk register, offset:0x44
    */
  __IO uint32_t BRK;

  /**
    * @brief tmr dmactrl register, offset:0x48
    */
  __IO uint32_t DMACTRL;

  /**
    * @brief tmr dmadt register, offset:0x4C
    */
  __IO uint32_t DMADT;

} TMR_TypeDef;

/**
  * @brief type define debug register all
  */
typedef struct
{
  /**
    * @brief debug idcode register, offset:0x00
    */
  __IO uint32_t IDCODE;

  /**
    * @brief debug ctrl register, offset:0x04
    */
  __IO uint32_t CTRL;

} DEBUG_TypeDef;

/**
  * @brief type define dma register
  */
typedef struct
{
  /**
    * @brief dma sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief dma clr register, offset:0x04
    */
  __IO uint32_t CLR;

  /**
    * @brief reserved, offset:0x08~0x9C
    */
  __IO uint32_t RESERVED1[38];

  /**
    * @brief dma src_sel0 register, offset:0xA0
    */
  __IO uint32_t SRC_SEL0;

  /**
    * @brief dma src_sel1 register, offset:0xA4
    */
  __IO uint32_t SRC_SEL1;
} DMA_TypeDef;

/**
  * @brief type define dma channel register all
  */
typedef struct
{
  /**
    * @brief dma ctrl register, offset:0x08+20*(x-1) x=1...7
    */
  __IO uint32_t CTRL;

  /**
    * @brief dma dtcnt register, offset:0x0C+20*(x-1) x=1...7
    */
  __IO uint32_t DTCNT;

  /**
    * @brief dma cpba register, offset:0x10+20*(x-1) x=1...7
    */
  __IO uint32_t PADDR;

  /**
    * @brief dma cmba register, offset:0x14+20*(x-1) x=1...7
    */
  __IO uint32_t MADDR;
} DMA_Channel_TypeDef;

/**
  * @brief type define adc register all
  */
typedef struct
{
  /**
    * @brief adc sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief adc ctrl1 register, offset:0x04
    */  
   __IO uint32_t CTRL1;

   /**
    * @brief adc ctrl2 register, offset:0x08
    */
  __IO uint32_t CTRL2;

  /**
  * @brief adc spt1 register, offset:0x0C
  */
  __IO uint32_t SPT1;

  /**
  * @brief adc spt2 register, offset:0x10
  */
  __IO uint32_t SPT2;

  /**
  * @brief adc pcdto1 register, offset:0x14
  */
  __IO uint32_t PCDTO1;

  /**
  * @brief adc pcdto2 register, offset:0x18
  */
  __IO uint32_t PCDTO2;

  /**
  * @brief adc pcdto3 register, offset:0x1C
  */
  __IO uint32_t PCDTO3;

  /**
  * @brief adc pcdto4 register, offset:0x20
  */
  __IO uint32_t PCDTO4;

  /**
  * @brief adc vmhb register, offset:0x24
  */
  __IO uint32_t VMHB;

  /**
  * @brief adc vmlb register, offset:0x28
  */
  __IO uint32_t VMLB;

  /**
  * @brief adc osq1 register, offset:0x2C
  */
  __IO uint32_t OSQ1;

  /**
  * @brief adc osq2 register, offset:0x30
  */
  __IO uint32_t OSQ2;

  /**
  * @brief adc osq3 register, offset:0x34
  */
  __IO uint32_t OSQ3;

  /**
  * @brief adc psq register, offset:0x38
  */
  __IO uint32_t PSQ;

  /**
  * @brief adc pdt1 register, offset:0x3C
  */
  __IO uint32_t PDT1;

  /**
  * @brief adc pdt2 register, offset:0x40
  */
  __IO uint32_t PDT2;

  /**
  * @brief adc pdt3 register, offset:0x44
  */
  __IO uint32_t PDT3;

  /**
  * @brief adc pdt4 register, offset:0x48
  */
  __IO uint32_t PDT4;

  /**
  * @brief adc odt register, offset:0x4C
  */
  __IO uint32_t ODT;

} ADC_TypeDef;

/**
  * @brief type define i2c register all
  */
typedef struct
{
  /**
    * @brief i2c ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief i2c ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief i2c oaddr1 register, offset:0x08
    */
  __IO uint32_t OADDR1;

  /**
    * @brief i2c oaddr2 register, offset:0x0C
    */
  __IO uint32_t OADDR2;
  /**
    * @brief i2c dt register, offset:0x10
    */
  __IO uint32_t DT;

  /**
    * @brief i2c sts1 register, offset:0x14
    */
  __IO uint32_t STS1;

  /**
    * @brief i2c sts2 register, offset:0x18
    */
  __IO uint32_t STS2;

  /**
    * @brief i2c clkctrl register, offset:0x1C
    */
  __IO uint32_t CLKCTRL;

  /**
    * @brief i2c tmrise register, offset:0x20
    */
  __IO uint32_t TMRISE;

